/* Status line above clock after alarm is stopped */
"Alarm terminated!" = "Herätys päätetty!";

/* Status line above clock during alarm */
"Press Any key to snooze" = "Torkku aktivoituu kaikista painikkeista";

/* Status line above clock during alarm */
"Press Any key to stop" = "Paina jotain painiketta lopettaaksesi";

/* Status line above clock during alarm */
"Press Enter to snooze" = "Paina Enter -painiketta aktivoidaksesi torkun";

/* Status line above clock during alarm */
"Press Enter to stop" = "Paina Enter -painiketta lopettaaksesi";

/* Button below clock */
"Snooze" = "Torkku";

/* Status line above clock during snooze */
"Snoozing until" = "Torkku aktivoitu tähän saakka:";

/* Status line above clock when first starting alarm */
"Starting alarm..." = "Käynnistä herätyksen...";

/* Button below clock */
"Stop" = "Lopeta";

